In [107]:
#Load the required libraries

import os
from zipfile import ZipFile
import pandas as pd

import seaborn as sns
import matplotlib.pyplot as plt

%matplotlib inline

In [108]:
# Main folder with data
tree = os.walk('C:/Users/Ark/0_ANALYSIS/DA_projects/collecting_data_from_diff_files/data_folder/')

In [109]:
#Collect files together
tree = os.walk('C:/Users/Ark/0_ANALYSIS/DA_projects/collecting_data_from_diff_files/data_folder/')
data_files = []
target_file = '.csv'

#look for files and paths
for item in tree:
    files = item[-1]
    
    for csv in files:
        if csv.endswith('.csv') == True:
            path = os.path.join(item[0], csv)
            data_files.append(path)

In [110]:
data_files

['C:/Users/Ark/0_ANALYSIS/DA_projects/collecting_data_from_diff_files/data_folder/folder_1\\prod_activations_logs.csv',
 'C:/Users/Ark/0_ANALYSIS/DA_projects/collecting_data_from_diff_files/data_folder/folder_2\\tm_sales_1.csv',
 'C:/Users/Ark/0_ANALYSIS/DA_projects/collecting_data_from_diff_files/data_folder/folder_2\\tm_sales_2.csv',
 'C:/Users/Ark/0_ANALYSIS/DA_projects/collecting_data_from_diff_files/data_folder/folder_2\\tm_sales_3.csv']

In [111]:
# Read files together
data_files_df = []

for path in data_files:
    df = pd.read_csv(path, index_col = 0, sep = ';').reset_index()
    data_files_df.append(df)

In [112]:
len(data_files_df)

4

In [135]:
data_files_df[3]

   FILIAL_ID  PROD_ID    SUBS_ID          ACT_DTTM
0          3     1499  id5764122  18-03-2020 15:44
1          6     3020  id7642700  15-03-2020 14:21
2          2     5677  id1374509  17-03-2020 11:48

In [114]:
data_files_df[1]

     SUBS_ID  FILIAL_ID  PROD_ID          ACT_DTTM
0  id4651830          1     1954  20-03-2020 14:59
1    7646509          5     6431  19-03-2020 13:00
2  id7412683          4     3313  22-03-2020 17:25

In [115]:
#gather lists together
df = pd.concat(data_files_df[1:4])

In [116]:
df

     SUBS_ID  FILIAL_ID  PROD_ID          ACT_DTTM
0  id4651830          1     1954  20-03-2020 14:59
1    7646509          5     6431  19-03-2020 13:00
2  id7412683          4     3313  22-03-2020 17:25
0  id5416547          3     1743  17-03-2020 10:17
1        NaN          4     7421  12-03-2020 11:25
2    8362218          7     9879  05-03-2020 11:42
3    2185490          2     3210  16-03-2020 16:28
0  id5764122          3     1499  18-03-2020 15:44
1  id7642700          6     3020  15-03-2020 14:21
2  id1374509          2     5677  17-03-2020 11:48

In [119]:
df = df.dropna(subset="SUBS_ID")

In [123]:
#Add "id" where it is needed.

In [131]:
df.loc[~df.SUBS_ID.str.startswith('id'), "SUBS_ID"] = \
    "id" + df.loc[~df.SUBS_ID.str.startswith('id'), "SUBS_ID"]

In [133]:
df

     SUBS_ID  FILIAL_ID  PROD_ID          ACT_DTTM
0  id4651830          1     1954  20-03-2020 14:59
1  id7646509          5     6431  19-03-2020 13:00
2  id7412683          4     3313  22-03-2020 17:25
0  id5416547          3     1743  17-03-2020 10:17
2  id8362218          7     9879  05-03-2020 11:42
3  id2185490          2     3210  16-03-2020 16:28
0  id5764122          3     1499  18-03-2020 15:44
1  id7642700          6     3020  15-03-2020 14:21
2  id1374509          2     5677  17-03-2020 11:48

In [157]:
all_df = df.merge(data_files_df[0], on=["SUBS_ID", "PROD_ID"]).drop(columns=["index"])

In [158]:
all_df

,SUBS_ID,FILIAL_ID,PROD_ID,ACT_DTTM,START_DTTM,END_DTTM
0,id4651830,1,1954,20-03-2020 14:59,20-03-2020 14:59,01-12-2020 00:00
1,id7646509,5,6431,19-03-2020 13:00,19-03-2020 13:00,19-03-2020 13:03
2,id5416547,3,1743,17-03-2020 10:17,17-03-2020 10:17,25-03-2020 11:00
3,id2185490,2,3210,16-03-2020 16:28,16-03-2020 16:28,01-12-2020 00:00
4,id7642700,6,3020,15-03-2020 14:21,15-03-2020 14:21,15-03-2020 23:42

In [159]:
all_df.dtypes

SUBS_ID       object
FILIAL_ID      int64
PROD_ID        int64
ACT_DTTM      object
START_DTTM    object
END_DTTM      object
dtype: object

In [160]:
#format columns to pd.datetime

In [161]:
all_df.START_DTTM = pd.to_datetime(all_df.START_DTTM)
all_df.ACT_DTTM = pd.to_datetime(all_df.ACT_DTTM)

In [162]:
all_df.END_DTTM = pd.to_datetime(all_df.END_DTTM, format = "%d-%m-%Y %H:%M")

In [163]:
all_df

,SUBS_ID,FILIAL_ID,PROD_ID,ACT_DTTM,START_DTTM,END_DTTM
0,id4651830,1,1954,2020-03-20 14:59:00,2020-03-20 14:59:00,2020-12-01 00:00:00
1,id7646509,5,6431,2020-03-19 13:00:00,2020-03-19 13:00:00,2020-03-19 13:03:00
2,id5416547,3,1743,2020-03-17 10:17:00,2020-03-17 10:17:00,2020-03-25 11:00:00
3,id2185490,2,3210,2020-03-16 16:28:00,2020-03-16 16:28:00,2020-12-01 00:00:00
4,id7642700,6,3020,2020-03-15 14:21:00,2020-03-15 14:21:00,2020-03-15 23:42:00

In [164]:
all_df.dtypes

SUBS_ID               object
FILIAL_ID              int64
PROD_ID                int64
ACT_DTTM      datetime64[ns]
START_DTTM    datetime64[ns]
END_DTTM      datetime64[ns]
dtype: object

In [165]:
#finding time difference between 'start' and 'end'

In [166]:
all_df['time_diff'] = all_df.END_DTTM - all_df.START_DTTM

In [167]:
all_df

,SUBS_ID,FILIAL_ID,PROD_ID,ACT_DTTM,START_DTTM,END_DTTM,time_diff
0,id4651830,1,1954,2020-03-20 14:59:00,2020-03-20 14:59:00,2020-12-01 00:00:00,255 days 09:01:00
1,id7646509,5,6431,2020-03-19 13:00:00,2020-03-19 13:00:00,2020-03-19 13:03:00,0 days 00:03:00
2,id5416547,3,1743,2020-03-17 10:17:00,2020-03-17 10:17:00,2020-03-25 11:00:00,8 days 00:43:00
3,id2185490,2,3210,2020-03-16 16:28:00,2020-03-16 16:28:00,2020-12-01 00:00:00,259 days 07:32:00
4,id7642700,6,3020,2020-03-15 14:21:00,2020-03-15 14:21:00,2020-03-15 23:42:00,0 days 09:21:00

In [168]:
#periods over 1 day

In [173]:
periods_id = all_df.loc[all_df.time_diff > pd.Timedelta(1, 'd')]

,SUBS_ID,FILIAL_ID,PROD_ID,ACT_DTTM,START_DTTM,END_DTTM,time_diff
0,id4651830,1,1954,2020-03-20 14:59:00,2020-03-20 14:59:00,2020-12-01 00:00:00,255 days 09:01:00
2,id5416547,3,1743,2020-03-17 10:17:00,2020-03-17 10:17:00,2020-03-25 11:00:00,8 days 00:43:00
3,id2185490,2,3210,2020-03-16 16:28:00,2020-03-16 16:28:00,2020-12-01 00:00:00,259 days 07:32:00